{
  "backend/main.mo": "Main Motoko actor for the ICP backend implementing blob storage, access control (admin/user roles), user profile management, and image upload/retrieval for homepage and logo images.",
  "feature_evidence.json": "Feature evidence report documenting two features: saving 14 new project photos as static assets in frontend/public/assets/generated/ and updating the Gallery component to display those 14 images.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each component's purpose, styling, and key functionality for the Kingston Customizations LLC website.",
  "frontend/index.html": "Root HTML entry point for the React app, setting the page title to 'KingstonCustomizations LLC Website' and mounting the app via /src/main.tsx.",
  "frontend/src/App.tsx": "Main React app component that sets up TanStack Router with routes for home (/) and admin (/admin), wrapped in ThemeProvider and QueryClientProvider.",
  "frontend/src/components/About.tsx": "About Us section component with a dark slate background, company description for Kingston Customizations LLC, and three value-proposition cards (Experience, Integrity, Excellence) with yellow-400 icon accents.",
  "frontend/src/components/Contact.tsx": "Contact section component displaying email, phone (call or text), business hours, and a location badge with yellow-400 accents and a dark business hours card.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with company info, contact details (email, phone, location), a services quick-link list, and a credentials/promise section, styled with a dark gradient and yellow accents.",
  "frontend/src/components/Gallery.tsx": "Displays a responsive image grid of 14 project photos with category labels, and a lightbox modal supporting previous/next navigation via keyboard-friendly controls.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with the Kingston Customizations logo/branding, a scroll-aware shadow effect, and a dropdown menu for section navigation and admin access.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section displaying the company logo and a bold headline tagline on a white background with fade-in animation.",
  "frontend/src/components/Services.tsx": "Renders a grid of 8 service cards (remodels, carpentry, drywall, etc.), each with an image, title, and description, styled with hover animations on a dark gradient background.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flows, identity persistence, and delegation validity checks, with a React context provider component.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching/mutating user profiles, admin status, and image uploads/retrievals (homepage image and logo) via the backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind base/components/utilities, defines OKLCH-based CSS custom properties for light and dark themes, and adds animation and image-rendering utilities.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that handles Internet Identity login/logout, user profile creation, and uploading homepage/logo images with file validation and previews.",
  "frontend/src/pages/HomePage.tsx": "Main public-facing page that composes all landing page sections (Header, Hero, Services, Gallery, About, Contact, Footer) with scroll-based header visibility and smooth section navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends border radius and box shadow, adds accordion keyframe animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata for Kingston Customizations website, tracking version, summary, known issues, required work-photo image descriptions, and existing implemented features."
}